In [4]:
import pandas as pd
import numpy as np

In [5]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [6]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

![Table 7_1](7_1.png)

**Filtering out Missing Data**

In [7]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned = data.dropna()#Dropping any rows with a missing value
cleaned

     0    1    2
0  1.0  6.5  3.0

In [13]:
data[4] = NA
data.dropna(axis = 1, how = 'all')#Drop only columns with all NA

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2]=NA
df

          0         1         2
0  0.303055       NaN       NaN
1 -0.306926       NaN       NaN
2  0.128347       NaN  0.914243
3 -0.396020       NaN -0.085862
4 -0.991619 -1.172262 -0.178502
5 -0.184295  0.543222  0.817788
6 -1.560526  0.438125 -0.060482

In [15]:
df.dropna(thresh = 2)

          0         1         2
2  0.128347       NaN  0.914243
3 -0.396020       NaN -0.085862
4 -0.991619 -1.172262 -0.178502
5 -0.184295  0.543222  0.817788
6 -1.560526  0.438125 -0.060482

**Filling in Missing Data**

In [16]:
df.fillna(0)

          0         1         2
0  0.303055  0.000000  0.000000
1 -0.306926  0.000000  0.000000
2  0.128347  0.000000  0.914243
3 -0.396020  0.000000 -0.085862
4 -0.991619 -1.172262 -0.178502
5 -0.184295  0.543222  0.817788
6 -1.560526  0.438125 -0.060482

In [17]:
df.fillna({1:.5, 2:0})

          0         1         2
0  0.303055  0.500000  0.000000
1 -0.306926  0.500000  0.000000
2  0.128347  0.500000  0.914243
3 -0.396020  0.500000 -0.085862
4 -0.991619 -1.172262 -0.178502
5 -0.184295  0.543222  0.817788
6 -1.560526  0.438125 -0.060482

In [18]:
_ = df.fillna(0,inplace =True)
df

          0         1         2
0  0.303055  0.000000  0.000000
1 -0.306926  0.000000  0.000000
2  0.128347  0.000000  0.914243
3 -0.396020  0.000000 -0.085862
4 -0.991619 -1.172262 -0.178502
5 -0.184295  0.543222  0.817788
6 -1.560526  0.438125 -0.060482

In [19]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  1.641488 -1.089789 -0.857565
1  1.327682  0.028656  0.385972
2  0.109701       NaN -0.284493
3  0.151576       NaN  0.099684
4  1.249408       NaN       NaN
5  0.103778       NaN       NaN

In [20]:
df.fillna(method="ffill")

          0         1         2
0  1.641488 -1.089789 -0.857565
1  1.327682  0.028656  0.385972
2  0.109701  0.028656 -0.284493
3  0.151576  0.028656  0.099684
4  1.249408  0.028656  0.099684
5  0.103778  0.028656  0.099684

In [21]:
df.fillna(method="ffill", limit=2)

          0         1         2
0  1.641488 -1.089789 -0.857565
1  1.327682  0.028656  0.385972
2  0.109701  0.028656 -0.284493
3  0.151576  0.028656  0.099684
4  1.249408       NaN  0.099684
5  0.103778       NaN  0.099684

In [22]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

![Table 7_2](7_2.png)